In [1]:
import numpy as np 
import pandas as pd

In [2]:
train_data = pd.read_csv(r"C:\Users\miste\OneDrive\Bureau\Kaggle competition\titanic\train.csv")
train_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
test_data = pd.read_csv(r"C:\Users\miste\OneDrive\Bureau\Kaggle competition\titanic\test.csv")
test_data.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [4]:
train_data = train_data.drop(["Name","Cabin","Ticket"],axis=1)
test_data = test_data.drop(["Name","Cabin","Ticket"],axis=1)

In [5]:
test_data.isnull().sum()

PassengerId     0
Pclass          0
Sex             0
Age            86
SibSp           0
Parch           0
Fare            1
Embarked        0
dtype: int64

In [6]:
train_data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Sex              0
Age            177
SibSp            0
Parch            0
Fare             0
Embarked         2
dtype: int64

In [7]:
test_data.dropna()

     PassengerId  Pclass     Sex   Age  SibSp  Parch      Fare Embarked
0            892       3    male  34.5      0      0    7.8292        Q
1            893       3  female  47.0      1      0    7.0000        S
2            894       2    male  62.0      0      0    9.6875        Q
3            895       3    male  27.0      0      0    8.6625        S
4            896       3  female  22.0      1      1   12.2875        S
..           ...     ...     ...   ...    ...    ...       ...      ...
409         1301       3  female   3.0      1      1   13.7750        S
411         1303       1  female  37.0      1      0   90.0000        Q
412         1304       3  female  28.0      0      0    7.7750        S
414         1306       1  female  39.0      0      0  108.9000        C
415         1307       3    male  38.5      0      0    7.2500        S

[331 rows x 8 columns]

In [8]:
train_data.dropna()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked
0,1,0,3,male,22.0,1,0,7.2500,S
1,2,1,1,female,38.0,1,0,71.2833,C
2,3,1,3,female,26.0,0,0,7.9250,S
3,4,1,1,female,35.0,1,0,53.1000,S
4,5,0,3,male,35.0,0,0,8.0500,S
...,...,...,...,...,...,...,...,...,...
885,886,0,3,female,39.0,0,5,29.1250,Q
886,887,0,2,male,27.0,0,0,13.0000,S
887,888,1,1,female,19.0,0,0,30.0000,S
889,890,1,1,male,26.0,0,0,30.0000,C
890,891,0,3,male,32.0,0,0,7.7500,Q

In [9]:
df2 = pd.read_csv(r"C:\Users\miste\OneDrive\Bureau\Kaggle competition\titanic\gender_submission.csv")
df2.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

In [13]:
test_data['Survived'] = df2['Survived']
test_data.head()

   PassengerId  Pclass     Sex   Age  SibSp  Parch     Fare Embarked  Survived
0          892       3    male  34.5      0      0   7.8292        Q         0
1          893       3  female  47.0      1      0   7.0000        S         1
2          894       2    male  62.0      0      0   9.6875        Q         0
3          895       3    male  27.0      0      0   8.6625        S         0
4          896       3  female  22.0      1      1  12.2875        S         1

In [14]:
women = train_data.loc[train_data.Sex=="female"]["Survived"]
rate_women = sum(women)/len(women)

print("% of women survived", rate_women)

% of women survived 0.7420382165605095

In [15]:
men = train_data.loc[train_data.Sex=="male"]["Survived"]
rate_men = sum(men)/len(men)

print("% of men survived", rate_men)

% of men survived 0.18890814558058924

In [22]:
from sklearn.ensemble import RandomForestClassifier

"""
y = train_data["Survived"]
features = ["Pclass", "Sex", "SibSp", "Parch"]

x_train = pd.get_dummies(train_data[features])
y_train = train_data['Survived']

x_test = pd.get_dummies(test_data[features])
y_test = test_data['Survived']


model = RandomForestClassifier(n_estimators=100, max_depth=5, random_state=1)
model.fit(x_train, y_train)
y_pred_train = model.predict(x_train)
y_pred_test = model.predict(x_test)

mse = mean_squared_error(y_train, y_pred_train)
print("MSE :", mse)

score = model.score(x_test, y_test)
print("score:", score)

r2 = r2_score(y_test, y_pred_test)
print("r2:", r2)
"""

'\ny = train_data["Survived"]\nfeatures = ["Pclass", "Sex", "SibSp", "Parch"]\n\nx_train = pd.get_dummies(train_data[features])\ny_train = train_data[\'Survived\']\n\nx_test = pd.get_dummies(test_data[features])\ny_test = test_data[\'Survived\']\n\n\nmodel = RandomForestClassifier(n_estimators=100, max_depth=5, random_state=1)\nmodel.fit(x_train, y_train)\ny_pred_train = model.predict(x_train)\ny_pred_test = model.predict(x_test)\n\nmse = mean_squared_error(y_train, y_pred_train)\nprint("MSE :", mse)\n\nscore = model.score(x_test, y_test)\nprint("score:", score)\n\nr2 = r2_score(y_test, y_pred_test)\nprint("r2:", r2)\n'

In [21]:
from sklearn.ensemble import RandomForestClassifier
model_2=RandomForestClassifier()

features = ["Pclass", "Sex", "SibSp", "Parch"]
X_train = pd.get_dummies(train_data[features])
y_train = train_data['Survived']

X_test = pd.get_dummies(test_data[features])
y_test = test_data['Survived']

model_2.fit(X_train,y_train)
predictions_2=model_2.predict(X_test)
model_2.score(X_test,y_test)

0.9330143540669856